{"task": "Use search_symbol to find emerging biotech companies by searching with keywords 'biotech' and review the results.", "difficulty": 2}
{"task": "Get the Relative Strength Index (RSI) for Alphabet Inc. (GOOGL) on a weekly interval using get_rsi.", "difficulty": 2}
{"task": "Fetch a detailed company overview for Alphabet Inc. (GOOGL) using get_company_overview.", "difficulty": 1}
{"task": "Backtest a trading strategy by fetching the daily time series data for Boeing (BA) using get_time_series_daily.", "difficulty": 2}
{"task": "Retrieve the current stock price for Apple (AAPL) using get_stock_quote.", "difficulty": 1}
{"task": "Conduct market research by using search_symbol with the keyword 'electric' to explore companies in the electric vehicle sector.", "difficulty": 2}
{"task": "For intraday technical analysis, calculate a 5-minute SMA for Apple (AAPL) and compare it to the current stock price.", "difficulty": 3}
{"task": "Search for the stock symbol related to 'Amazon' using search_symbol to find the right ticker.", "difficulty": 1}
{"task": "For fundamental analysis, retrieve the company overview for IBM using get_company_overview.", "difficulty": 1}
{"task": "Assess Tesla's (TSLA) momentum by obtaining its 14-day RSI on a daily interval using get_rsi.", "difficulty": 2}
{"task": "Perform a risk analysis for Johnson & Johnson (JNJ) by retrieving both the 30-day SMA and daily RSI, then comparing the indicators.", "difficulty": 4}
{"task": "For algorithmic trading, calculate the 15-minute SMA for Microsoft (MSFT) and compare it against its real-time stock price using get_sma and get_stock_quote.", "difficulty": 4}
{"task": "Download the daily time series data for Netflix (NFLX) to analyze historical performance using get_time_series_daily.", "difficulty": 1}
{"task": "For an active day trader, fetch the daily RSI for Apple (AAPL) to identify potential overbought or oversold conditions using get_rsi.", "difficulty": 2}
{"task": "Identify potential overbought conditions by retrieving the daily RSI for Amazon (AMZN) using get_rsi.", "difficulty": 2}
{"task": "Obtain the daily time series data (last 100 data points) for Microsoft (MSFT) using get_time_series_daily.", "difficulty": 1}
